[
  {
    "_id": "5fb3675e723a2200111c8a08",
    "post_docs": {
      "_id": "5fc86e20adab2906bc88af9f",
      "poster": "krys",
      "image": null,
      "organization_id": null,
      "activity_id": null,
      "typed_content": "currently 12/2/2020 8:48PM (20:48 military time) WHAT TIME ZONE IS THE MONGO DATE",
      "date_posted": "2020-12-03T04:48:32.952Z"
    },
    "attached_organizations": [],
    "attached_activities": [],
    "pretty_date": "12-03-2020 04:48"
  },
  {
    "_id": "5fb3675e723a2200111c8a08",
    "post_docs": {
      "_id": "5fc8531d44c265527cd8ad7c",
      "poster": "krys",
      "image": null,
      "organization_id": "10871",
      "activity_id": null,
      "typed_content": "post from trending w/ org",
      "date_posted": "2020-12-03T02:53:17.796Z"
    },
    "attached_organizations": [
      {
        "_id": "5facbd95858794f85cd7fedb",
        "name": "Keep The Dream196",
        "mission": "VISION: To see all children enter adulthood with holistic skills and abilities necessary to contribute effectively to the development of South Africa\n\nORGANISATION MISSION:\n \"Our mission is to assist children to overcome difficult life circumstances by building resilience, physically, emotionally, spiritually and psychologically, using a Right's based framework, so they are able to realize their full potential and contribute to the building of South Africa.\"",
        "logo_url": "https://www.globalgiving.org/pfil/organ/10871/orglogo.jpg",
        "url": "http://www.keepthedream196.com",
        "gg_id": "10871",
        "countries": ["South Africa"],
        "themes": [
          "Child Protection",
          "Climate Action",
          "Peace and Reconciliation",
          "Education",
          "Ecosystem Restoration",
          "Gender Equality",
          "Physical Health",
          "Justice and Human Rights"
        ]
      }
    ],
    "attached_activities": [],
    "pretty_date": "12-03-2020 02:53"
  },
  {
    "_id": "5fb3675e723a2200111c8a08",
    "post_docs": {
      "_id": "5fc833904b286e00084eac7d",
      "poster": "testingpics",
      "image": null,
      "organization_id": null,
      "activity_id": null,
      "typed_content": "making another post",
      "date_posted": "2020-12-03T00:38:40.951Z"
    },
    "attached_organizations": [],
    "attached_activities": [],
    "pretty_date": "12-03-2020 00:38"
  },
  {
    "_id": "5fb3675e723a2200111c8a08",
    "post_docs": {
      "_id": "5fc833874b286e00084eac7c",
      "poster": "testingpics",
      "image": null,
      "organization_id": null,
      "activity_id": null,
      "typed_content": "making posts",
      "date_posted": "2020-12-03T00:38:31.943Z"
    },
    "attached_organizations": [],
    "attached_activities": [],
    "pretty_date": "12-03-2020 00:38"
  },
  {
    "_id": "5fb3675e723a2200111c8a08",
    "post_docs": {
      "_id": "5fc40045964b5839b0bbf61b",
      "poster": "krys",
      "image": null,
      "organization_id": null,
      "activity_id": null,
      "typed_content": "posting from timeline",
      "date_posted": "2020-11-29T20:10:45.291Z"
    },
    "attached_organizations": [],
    "attached_activities": [],
    "pretty_date": "11-29-2020 20:10"
  },
  {
    "_id": "5fb3675e723a2200111c8a08",
    "post_docs": {
      "_id": "5fc3ffd3964b5839b0bbf61a",
      "poster": "krys",
      "image": null,
      "organization_id": "9279",
      "activity_id": null,
      "typed_content": "making post from trending whooo!!",
      "date_posted": "2020-11-29T20:08:51.501Z"
    },
    "attached_organizations": [
      {
        "_id": "5facbd72858794f85cd7fd6a",
        "name": "Soccer Without Borders",
        "mission": "Mission:\n\nSoccer Without Borders uses soccer as a vehicle for positive change, providing under served youth a toolkit to overcome obstacles to growth, inclusion, and personal success.\n\nCore Values:\n\nFocus on the Whole Person: SWB believes in a whole-person approach. Our programs help young people come into a greater understanding of their bodies, minds, and voices, creating avenues toward individual growth, new opportunities, and the achievement of personal goals. \n\nAuthenticity:  Soccer Without Borders gives voice and value to the ideas of local leaders. In addition to imported human, physical, and intellectual resources, SWB mobilizes local expertise, empowering and employing resident experts to educate from within the community. In every program, SWB places immediate priority on creating an environment of ownership and investment among local staff, providing on and off field training, leadership opportunities and formal employment.  SWB implements a three-step process; also known as the SWB Way, to ensure programming is authentic and responsive to local needs.  Every SWB program is devoted to this process.  Below are the three essential elements of each step:\n\n1. Engage youth and their communities through soccer teams.\n2. Collaborate with youth families, schools, and community leaders to identify obstacles facing youth     and to set meaningful/measurable goals\n3. Realize Provide consistent on and off field programming that supports youth to realize healthy bodies, active minds and confident voices.\n\nProcess-oriented: SWB believes that the process is often more important than the outcome. SWB leadership, participants and families commit to uphold process-oriented values that create a culture of acceptance, an inclusive environment, and supported progress toward goals.\n\nGoals:\n\nThe goals SWB has for its participants range depending on the span of time a participant has been involved in programming.  Over the short to mid term, SWB anticipates that through regular and positive attendance a participant will grow in each of the five following areas: competence, compassion, character, connection, and confidence.  In competence, a participant will improve basic soccer skills, be able to set personal and team goals, and have the information needed to avoid major risks.  In the area of compassion, each youth will participate in one community service project per season, each participant will welcome and support their teammates, and each participant will learn how to work well with others.  In character, each participant is asked to sign and abide by a team contract that outlines guidelines for mutual respect.  In the area of connection, each participant will establish a relationship with at least one adult, each participant will make new friends and become part of a supportive peer group, and each participant has expanded access to community resources.  Lastly, in the area of confidence, each participant will regularly receive positive feedback, each participant will be able to articulate their positive attributes and personal priorities and each participant can lead or speak in front of a group.  \nWhen a participant takes part in SWB programming over the short and mid term (1-3 years) and reaches the five above mentioned areas, the goal is that over the long-term each participant will have the skills and abilities necessary to experience growth, inclusion and personal success in their respective community.\n\nIn the Nicaragua site, T.E.A.M. (Trabajando en Equipo Aprendemos Mas) Granada, the mission, core values and goals of the organization are the same as those already mentioned.  The Granada site differs from many other SWB sites in that it works exclusively with girls to promote each participants growth in the areas of competence, compassion, character, connection, and confidence.  Throughout Nicaragua girls are afforded very few opportunities to engage in communities outside of their homes, schools and churches.  T.E.A.M. Granada exists to provide girls with recreational and extracurricular opportunities that are not otherwise available and in doing so provides them with a support network of mentors and peers that they may not encounter elsewhere.  The main draw of SWB for program youth is to provide them with an identity they can take pride in and an identity that they can rely on for support as they work to grow as leaders, meet their personal goals and rewrite the pervasive machismo that exists in their home country.",
        "logo_url": "https://www.globalgiving.org/pfil/organ/9279/orglogo.jpg",
        "url": "http://www.soccerwithoutborders.org",
        "gg_id": "9279",
        "countries": ["El Salvador", "Nicaragua", "Uganda", "United States"],
        "themes": ["Education", "Gender Equality", "Sport"]
      }
    ],
    "attached_activities": [],
    "pretty_date": "11-29-2020 20:08"
  },
  {
    "_id": "5fb3675e723a2200111c8a08",
    "post_docs": {
      "_id": "5fc3ff85964b5839b0bbf619",
      "poster": "krys",
      "image": null,
      "organization_id": null,
      "activity_id": null,
      "typed_content": "making a post :)",
      "date_posted": "2020-11-29T20:07:33.662Z"
    },
    "attached_organizations": [],
    "attached_activities": [],
    "pretty_date": "11-29-2020 20:07"
  }
]
